      *****************************************************************
      *           PROGRAMA DE MIGUEL ANTONIO CHAMORRO MARTINEZ        *
      *                                                               *
      *  ESTE PROGRAMA CARGGA UN ARCHIVO Y REALIZAMOS OPERACIONES     *
      *  SOBRE DICHO FICHERO SACANDO DOS FICHEROS DE SALIDA           *
      *                                                               *
      *****************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID.    RUTEMPLE.
      *
      *****************************************************************
      *                  ENVIROMENT DIVISION                          *
      *****************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
      *
      *****************************************************************
      *                    DATA DIVISION                              *
      *****************************************************************
       DATA DIVISION.
       FILE SECTION.
      *
      *****************************************************************
      *               WORKING STORAGE SECTION                         *
      *****************************************************************
       WORKING-STORAGE SECTION.
      *
      *****************************************************************
      *               VARIABLES  FICHERO ENTRADA                      *
      *****************************************************************
      *
      *****************************************************************
      *               VARIABLES  FICHERO SALIDA                       *
      *****************************************************************
      *
      *****************************************************************
      *               SWITCHES                                        *
      *****************************************************************
      *
      *****************************************************************
      *               CONSTANTES Y LITERALES                          *
      *****************************************************************
      *
      *****************************************************************
      *               VARIABLES AUXILIARES                            *
      *****************************************************************
      *
      *****************************************************************
      *               CONTADORES                                      *
      *****************************************************************
      *
      *****************************************************************
      *               LINKAGE SECTION                                 *
      *****************************************************************
       LINKAGE SECTION.
       COPY RUTEMPL1.
      *
      *****************************************************************
      *               PROCEDURE  DIVISION.                            *
      *****************************************************************
       PROCEDURE DIVISION USING CP100-RUTEMPL1.
      *
           PERFORM 1000-INICIO
              THRU 1000-INICIO-EXIT.
      *
           PERFORM 3000-PROCESO
              THRU 3000-PROCESO-EXIT.
      *
           PERFORM 8000-FIN
              THRU 8000-FIN-EXIT.
      *
      *****************************************************************
      *               INICIO                                          *
      *****************************************************************
       1000-INICIO.
           INITIALIZE CP100-OUTPUT
                      CP100-ERROR.
       1000-INICIO-EXIT.
       EXIT.
      *****************************************************************
      *             PROCESO                                           *
      *****************************************************************
       3000-PROCESO.

           EVALUATE CP100I-EMPNO(6:1)
             WHEN 0
             WHEN 2
             WHEN 4
             WHEN 6
             WHEN 8
                MOVE 'M' TO CP100O-GENRE
             WHEN 1
             WHEN 3
             WHEN 5
             WHEN 7
             WHEN 9
                MOVE 'F' TO CP100O-GENRE

           END-EVALUATE.
      *
       3000-PROCESO-EXIT.
       EXIT.
      *****************************************************************
      *             FIN                                               *
      *****************************************************************
       8000-FIN.
       GOBACK.
      *
       8000-FIN-EXIT.
       EXIT.
